app/views/breweries/index.json.jbuilder

SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 4]]
---

	json.labelCount brewery.beers.count